OE625b/cppClient/wst.RequestSecurityToken.req.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope
  xmlns:SOAP-ENV="http://www.w3.org/2003/05/soap-envelope"
  xmlns:SOAP-ENC="http://www.w3.org/2003/05/soap-encoding"
  xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
  xmlns:xsd="http://www.w3.org/2001/XMLSchema"
  xmlns:JR3="http://schemas.microsoft.com/2003/10/Serialization/"
  xmlns:wbICalc2="http://tempuri.org/w07bICalc"
  xmlns:JR2="http://o2.jrrpc.com/"
  xmlns:c14n="http://www.w3.org/2001/10/xml-exc-c14n#"
  xmlns:xenc="http://www.w3.org/2001/04/xmlenc#"
  xmlns:wsc="http://schemas.xmlsoap.org/ws/2005/02/sc"
  xmlns:ds="http://www.w3.org/2000/09/xmldsig#"
  xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd"
  xmlns:chan="http://schemas.microsoft.com/ws/2005/02/duplex"
  xmlns:wsa5="http://www.w3.org/2005/08/addressing"
  xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd"
  xmlns:wst="http://schemas.xmlsoap.org/ws/2005/02/trust"
  xmlns:wbICalc3="http://tempuri.org/wbICalc">
 <SOAP-ENV:Header>
  <wsa5:MessageID></wsa5:MessageID>
  <wsa5:RelatesTo RelationshipType=""></wsa5:RelatesTo>
  <wsa5:From>
   <wsa5:Address></wsa5:Address>
   <wsa5:ReferenceParameters>
    <chan:ChannelInstance>0</chan:ChannelInstance>
    <!-- extensibility element(s) -->

    <!-- extensibility element(s) -->

   </wsa5:ReferenceParameters>
   <wsa5:Metadata>
    <!-- extensibility element(s) -->

    <!-- extensibility element(s) -->

   </wsa5:Metadata>
   <!-- extensibility element(s) -->

   <!-- extensibility element(s) -->

  </wsa5:From>
  <wsa5:ReplyTo>
   <wsa5:Address></wsa5:Address>
   <wsa5:ReferenceParameters>
    <chan:ChannelInstance>0</chan:ChannelInstance>
    <!-- extensibility element(s) -->

    <!-- extensibility element(s) -->

   </wsa5:ReferenceParameters>
   <wsa5:Metadata>
    <!-- extensibility element(s) -->

    <!-- extensibility element(s) -->

   </wsa5:Metadata>
   <!-- extensibility element(s) -->

   <!-- extensibility element(s) -->

  </wsa5:ReplyTo>
  <wsa5:FaultTo>
   <wsa5:Address></wsa5:Address>
   <wsa5:ReferenceParameters>
    <chan:ChannelInstance>0</chan:ChannelInstance>
    <!-- extensibility element(s) -->

    <!-- extensibility element(s) -->

   </wsa5:ReferenceParameters>
   <wsa5:Metadata>
    <!-- extensibility element(s) -->

    <!-- extensibility element(s) -->

   </wsa5:Metadata>
   <!-- extensibility element(s) -->

   <!-- extensibility element(s) -->

  </wsa5:FaultTo>
  <wsa5:To></wsa5:To>
  <wsa5:Action></wsa5:Action>
 </SOAP-ENV:Header>
 <SOAP-ENV:Body>
   <wst:RequestSecurityToken Context="">
    <wst:TokenType></wst:TokenType>
    <wst:RequestType></wst:RequestType>
    <wst:KeySize>0</wst:KeySize>
    <wst:BinaryExchange ValueType="" EncodingType=""></wst:BinaryExchange>
   </wst:RequestSecurityToken>

 </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
